---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DirectContext3DHandleSettings Constructor
DirectContext3DHandleSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | DirectContext3DHandleSettings()()()() | Constructs an instance of settings with default values. |
|  | DirectContext3DHandleSettings(DirectContext3DHandleSettings) | Constructs a copy of source object. |
|  | DirectContext3DHandleSettings(Boolean, Int32) | Constructs an instance of settings with provided values. |

# See Also

DirectContext3DHandleSettings Class

DirectContext3DHandleSettings Members

Autodesk.Revit.DB.DirectContext3D Namespace